In [1]:
# Generate a .csv file with only the names of recent artists

import pandas as pd
import numpy as np

import datetime as dt
import time

billboard = pd.DataFrame.from_csv('BillboardData_mod_2000.csv',index_col=False)
billboard.tail()

,id,year,yearly_rank,source,prefix,ch,x40,x10,pk,high,...,x82nd_week,x83rd_week,x84th_week,x85th_week,x86th_week,x87th_week,x88th_week,x89th_week,x90th_week,x91st_week
5727,11758,2015,147,h,2015-147,20,18,5,1,8,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5728,23109,2015,148,h,2015-148,20,18,8,1,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5729,36992,2015,149,h,2015-149,1,0,0,1,45,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5730,7173,2015,150,h,2015-150,1,0,0,1,50,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5731,39589,2015,151,h,2015-151,1,0,0,1,51,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [2]:
# get a sample of artists
only15 = billboard[billboard.year == 2015]
only14_15 = billboard[billboard.year > 2013]
only10_15 = billboard[billboard.year > 2009]

In [5]:
artists15 = only15.artist_standardized.unique()
len(artists15)

110

In [6]:
artists14_15 = only14_15.artist_standardized.unique()
len(artists14_15)

281

In [7]:
artists10_15 = only10_15.artist_standardized.unique()
len(artists10_15)

631

In [8]:
artist_names_15 = pd.DataFrame(list(artists15),columns=['artist_name'])
artist_names_14_15 = pd.DataFrame(list(artists14_15),columns=['artist_name'])
artist_names_10_15 = pd.DataFrame(list(artists10_15),columns=['artist_name'])

In [37]:
artist_names_15.head()

            artist_name
0          Milky Chance
1          Fall Out Boy
2            Nick Jonas
3        Meghan Trainor
4  Florida Georgia Line

In [10]:
artist_names_14_15.to_csv('billboard_artist_names_2014_15.csv',encoding="utf-8")
artist_names_15.to_csv('billboard_artist_names_2015.csv',encoding="utf-8")
artist_names_10_15.to_csv('billboard_artist_names_2010_15.csv',encoding="utf-8")